WALE/system/extrudeMeshDict.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')

constructFrom patch;
sourceCase ".";
sourcePatches (x0);

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName x1;

// Flip surface normals before usage.
flipNormals false;

//- Linear extrusion in point-normal direction
//extrudeModel        linearDirection;
extrudeModel	    linearNormal;

nLayers             axialResolution;

expansionRatio      1.0;

linearNormalCoeffs
{
    thickness       pipeLength;
}

//linearDirectionCoeffs
//{
//    direction       (1 0 0);
//    thickness       pipeLength;
//}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
